# organization-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-kafka-cluster-id]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-organization]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-organization-database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-organization-database-migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-organization-database-migration"
        name       = "staging-organization-database-migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "05d3089b-7eef-4fb7-87f3-c00c506325e1" -> "c09f385e-d586-491e-81ff-cf2e372c82c8"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default will be created
  + resource "upstash_kafka_topic" "default" {
      + cleanup_policy   = "delete"
      + cluster_id       = (sensitive value)
      + creation_time    = (known after apply)
      + id               = (known after apply)
      + max_message_size = 829213
      + multizone        = (known after apply)
      + partitions       = 3
      + password         = (sensitive value)
      + region           = (known after apply)
      + rest_endpoint    = (known after apply)
      + retention_size   = 725124
      + retention_time   = 625135
      + state            = (known after apply)
      + tcp_endpoint     = (known after apply)
      + topic_id         = (known after apply)
      + topic_name       = "organization.v1"
      + username         = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*